
    <!-- О нас -->
    <div class="container">

        <div class="about-page">
            <h2>О нас</h2>
            <p>
                С первых дней работы нашей компании, мы старались выделяться на рынке земельных участков своим подходом
                к работе с клиентами. Мы знаем, что приобретение земельного участка является большой сделкой для наших
                клиентов. Именно поэтому мы делаем все возможное, чтобы наши клиенты чувствовали себя защищенными и
                уверенными в выборе участка земли.
            <p>
                На протяжении десяти лет нашей работы мы продали более 2000
                участков земли для постройки коттеджей и дач. Мы помогли нашим клиентам осуществить мечту о создании
                экологически чистого и уютного уголка для отдыха и проживания.
            </p>
            <p> Наша компания является лидером на рынке продажи земельных участков у леса. У нас есть огромный опыт
                работы с клиентами и наши консультанты всегда готовы оказать помощь в выборе участка, удовлетворяющего
                потребности каждого клиента.</p>

            </p>
            <ul>
                <li>
                    - Мы знаем, как работают государственные органы и коммунальныe службы в Московской области.
                </li>
                <li>
                    - Мы знакомы с судебной практикой местных судов.
                </li>
                <li>
                    - Мы знаем перспективы развития региональной инфраструктуры.
                </li>
                <li>
                    - Мы можем избавить вас от необходимости обивать пороги чиновников и стоять в очередях.
                </li>
            </ul>
            <a href="document/Privacy Policy.pdf" target="_blank">Политика конфидициальности</a>
        </div>
    </div>
    <div class="about-images">
       <a href="media/images/about/about1.jpg" target="_blank"><img src="media/images/about/about1.jpg" alt=""></a> 
       <a href="media/images/about/about2.jpg" target="_blank"><img src="media/images/about/about2.jpg" alt=""></a> 
       <a href="media/images/about/about3.jpg" target="_blank"><img src="media/images/about/about3.jpg" alt=""></a> 
       <a href="media/images/about/about4.jpg" target="_blank"><img src="media/images/about/about4.jpg" alt=""></a> 
    </div>
    <!-- О нас -->