<?php
unset($_SESSION['errors']);
$items = $database->query("SELECT * FROM `tovars` LIMIT 3")->fetchAll(2);
$category = $database->query("SELECT * FROM `categories`")->fetchAll(2);



if (isset($_POST['subscribe'])) {
    $email = htmlspecialchars($_POST['user_mail']);
    $email = trim($email);
    if (empty($email)) {
        $_SESSION['errors'][] = '<div class="error_sub">Заполните поле</div>';
    } else {
        $subscribers = $database->query("SELECT * FROM `subscribers` WHERE `mail` = '$email'")->fetch(2);
        if ($subscribers) {
            $_SESSION['errors'][] = '<div class="complete_sub">Вы уже подписаны на рассылку</div>';
        }

        if (empty($_SESSION['errors'])) {
            $state = $database->prepare("INSERT INTO `subscribers`(`mail`) VALUES ('$email')");
            $state->execute();
            $_SESSION['errors'][] = '<div class="complete_sub">Вы подписаны</div>';
        }
    }

}





?>
<!-- Банер -->
<div class="baner">
    <div class="baner-body">
        <div class="baner-text">
            <h1>Стань ближе к природе <br>
                <span>на один участок</span>
            </h1>
            <a href="?page=catalog" class="btn">Купить</a>
        </div>

    </div>
    <video autoplay loop muted preload="auto">
        <source type="video/mp4" src="media/videos/forest.mp4">
    </video>
</div>
<!-- Банер -->
<!-- Поиск -->
<div class="container">
    <div class="search-body padd100">
        <h2>Поиск участка для вас</h2>
        <form action="" class="search" method="GET" name="search_main">
            <select name="piece_category" id="">
                <option value="all">Все категории</option>
                <?php foreach ($category as $category_one): ?>
                    <option value="<?= $category_one['id']; ?>"><?= $category_one['name']; ?></option>
                <?php endforeach; ?>
            </select>
            <div class="search-item">
                <label for="">Соток</label>
                <input type="numb" name="weaving_from" placeholder="от">
                <input type="text" name="weaving_to" placeholder="до">
            </div>
            <div class="search-item">
                <label for="">Стоимость ₽</label>
                <input type="text" name="price_from" placeholder="от">
                <input type="text" name="price_to" placeholder="до">
            </div>
            <input type="submit" class="submit"  value="Найти">
        </form>
    </div>
</div>
<div class="parallax">
    <div data-speed="10" id="hills1" class="parallax-img parallax1"> </div>
    <div data-speed="30" id="hills2" class="parallax-img parallax2"> </div>
    <div data-speed="100" id="hills3" class="parallax-img parallax3"> </div>
    <div data-speed="40" id="text" class="parallax-img parallax4"> SPRUCE </div>
    <div data-speed="100" id="hills4" class="parallax-img parallax5"> </div>
</div>
<!-- Поиск -->
<!-- Лучшие предложения -->
<div id="itemss" class="container items padd100">
    <h2>Лучшие предложения</h2>

    <div class="items-grid">

        <?php
        foreach ($items as $item):
            ?>

            <div class="item">
                <img src="<?= $item['image'] ?>" alt="">
                <div class="item-text">
                    <p>
                        <?php foreach ($category as $category_one): ?>
                            <?php if ($category_one['id'] == $item['category']): ?>
                                <?= $category_one['name'] . ' ' . $item['number'] ?>
                            <?php endif; ?>
                        <?php endforeach; ?>

                    </p>
                    <span>
                        <?= $item['price'] ?> ₽
                    </span>
                    <a href="?page=item&product_id=<?= $item['id'] ?>" class="btn">подробнее</a>
                </div>
            </div>

        <?php endforeach; ?>

    </div>
    <form action="/?page=catalog" class="pagin" method="POST">
        <input type="Submit" name="pagin" value="Больше участков">
    </form>

</div>
<!-- Лучшие предложения -->
<!-- О нас -->
<div class="about">
    <div class=" container ">
        <div class="about-text">
            <h2>О нас</h2>
            <p> С первых дней работы нашей компании, мы старались выделяться на рынке земельных участков своим
                подходом
                к работе с клиентами. Мы знаем, что приобретение земельного участка является большой сделкой для
                наших
                клиентов. Именно поэтому мы делаем все возможное, чтобы наши клиенты чувствовали себя защищенными и
                уверенными в выборе участка земли.</p>
            <div class="about-imgs">
                <div class="about-imgs-text">
                    <b>2000+</b> <br> <span>проданных участков</span>
                </div>
                <div class="about-imgs-text">
                    <b>20+</b> <br> <span> опытных сотрудников</span>
                </div>
                <div class="about-imgs-text">
                    <b>10 лет</b> <br> <span> лидеры продажи участков</span>
                </div>

            </div>
            <a href="?page=about">подробнее</a>
        </div>
    </div>
</div>
<!-- О нас -->
<!-- Экология -->
<div class="container">
    <div class="ecology">
        <h2>Экология участков</h2>
        <div class="ecology-grid">
            <div class="ecology-item">
                <img src="media/images/ecology/water.png" alt="">
                <p>Самые прозрачные реки <br>
                    возле поселков</p>
            </div>
            <div class="ecology-item">
                <img src="media/images/ecology/day.png" alt="">
                <p>Регулярная уборка <br>
                    территории поселков</p>
            </div>
            <div class="ecology-item">
                <img src="media/images/ecology/volume.png" alt="">
                <p>Возможность жить в тихих <br>
                    и спокойных местах</p>
            </div>
        </div>
    </div>
</div>
<!-- Экология -->
<!-- Рассылка -->
<div id="sub" class="mailing">
    <div class="container">
        <form action="#sub" method="POST" class="form-mailing">
            <h2>Стань одним из первых, узнавших о новом участке в продаже!</h2>
            <input type="email" name="user_mail" placeholder="Email">
            <input type="submit" name="subscribe" class="btn" value="Подписаться">
            <?php
            if (isset($_SESSION['errors'])) {
                foreach ($_SESSION['errors'] as $error) {
                    echo $error;
                    unset($_SESSION['errors']);
                    break;
                }
            }

            ?>
        </form>
    </div>
</div>
<!-- Рассылка -->
<!-- Карта -->
<div class="map">
    <div class="map-text">
        <h2>Контакты</h2>
        <p><b>Адрес:</b> ул. Бари Галеева 3а</p>
        <p>Вы можете в задавать свои вопросы по телефону или писать на электронную почту!</p>
        <div class="phone-mail">
            <p><b>Телефон:</b> 8(951)-064-97-70</p>
            <p><b>Email:</b>Spruce@mail.ru</p>
        </div>
        <p>Так же мы ведем группы в социальных сетях, где вы всегда можете узнавать о новых участках выставленых
            на продажу</p>
        <div class="networks">
            <svg width="75" height="75" viewBox="0 0 78 78" fill="none" xmlns="http://www.w3.org/2000/svg"><a href="https://discord.com/">
                <path
                    d="M39 78C60.5391 78 78 60.5391 78 39C78 17.4609 60.5391 0 39 0C17.4609 0 0 17.4609 0 39C0 60.5391 17.4609 78 39 78Z"
                    fill="#6B6B6B" />
                <path
                    d="M52.5152 26.584C49.9866 25.4234 47.3181 24.5959 44.5765 24.1221C44.5516 24.1174 44.5258 24.1206 44.5028 24.1314C44.4798 24.1422 44.4608 24.16 44.4486 24.1823C44.0846 24.8421 43.7541 25.5199 43.4583 26.213C40.5033 25.7642 37.4975 25.7642 34.5424 26.213C34.2454 25.5182 33.9102 24.8402 33.5385 24.1823C33.5257 24.1605 33.5067 24.1431 33.4838 24.1323C33.461 24.1216 33.4354 24.118 33.4105 24.1221C30.6697 24.5951 28.0022 25.4227 25.4749 26.584C25.4532 26.5931 25.4348 26.6088 25.4224 26.6289C20.3668 34.1829 18.982 41.551 19.6615 48.8262C19.6634 48.8441 19.6689 48.8614 19.6777 48.8771C19.6865 48.8928 19.6983 48.9065 19.7125 48.9176C22.6564 51.0983 25.9495 52.763 29.4511 53.8406C29.4758 53.848 29.5022 53.8476 29.5267 53.8396C29.5512 53.8315 29.5727 53.8162 29.5882 53.7956C30.3401 52.7721 31.0063 51.6883 31.5801 50.5553C31.5879 50.5397 31.5924 50.5227 31.5932 50.5053C31.5939 50.4879 31.591 50.4706 31.5846 50.4544C31.5782 50.4382 31.5685 50.4235 31.556 50.4114C31.5435 50.3992 31.5287 50.3899 31.5123 50.3839C30.4616 49.9826 29.4443 49.4986 28.47 48.9366C28.4523 48.9262 28.4375 48.9116 28.4268 48.8941C28.4161 48.8766 28.4098 48.8568 28.4086 48.8363C28.4074 48.8158 28.4113 48.7953 28.4199 48.7767C28.4284 48.7581 28.4415 48.7418 28.4578 48.7294C28.662 48.5771 28.8669 48.4171 29.0619 48.2556C29.0792 48.2414 29.1001 48.2323 29.1223 48.2294C29.1445 48.2264 29.1671 48.2297 29.1875 48.2389C35.57 51.1532 42.4803 51.1532 48.7873 48.2389C48.8079 48.229 48.8309 48.2252 48.8535 48.2279C48.8762 48.2306 48.8976 48.2397 48.9153 48.2541C49.1103 48.4148 49.3152 48.5763 49.5247 48.7294C49.5411 48.7417 49.5542 48.7579 49.5629 48.7764C49.5716 48.795 49.5756 48.8154 49.5746 48.8359C49.5735 48.8563 49.5674 48.8762 49.5569 48.8938C49.5463 48.9114 49.5316 48.9261 49.514 48.9366C48.541 49.504 47.5217 49.9882 46.4671 50.3839C46.4507 50.3901 46.4358 50.3997 46.4233 50.4121C46.4109 50.4245 46.4012 50.4394 46.3949 50.4558C46.3886 50.4722 46.3859 50.4898 46.387 50.5073C46.388 50.5249 46.3927 50.542 46.4009 50.5576C46.9843 51.6844 47.6495 52.7669 48.3912 53.7964C48.4063 53.8176 48.4276 53.8335 48.4523 53.8418C48.4769 53.8502 48.5035 53.8505 48.5283 53.8429C52.0347 52.7684 55.3321 51.1036 58.2783 48.9199C58.2928 48.9094 58.3048 48.8959 58.3136 48.8804C58.3224 48.8649 58.3278 48.8477 58.3294 48.83C59.1429 40.4176 56.9674 33.1096 52.5632 26.632C52.5533 26.6108 52.5363 26.5938 52.5152 26.584ZM32.5322 44.3968C30.6104 44.3968 29.0283 42.6326 29.0283 40.4663C29.0283 38.3 30.5807 36.5358 32.5322 36.5358C34.4998 36.5358 36.0681 38.3152 36.0362 40.4663C36.0377 42.6326 34.4845 44.3968 32.5322 44.3968ZM45.4914 44.3968C43.5696 44.3968 41.9875 42.6326 41.9875 40.4663C41.9875 38.3 43.5398 36.5358 45.4914 36.5358C47.4589 36.5358 49.0273 38.3152 48.9953 40.4663C48.996 42.6326 47.4589 44.3968 45.4914 44.3968Z"
                    fill="white" /></a>
            </svg>



            <svg width="75" height="75" viewBox="0 0 96 96" fill="none" xmlns="http://www.w3.org/2000/svg"> <a
                    href="https://vk.com/mck_ktits">
                    <path
                        d="M48 96C74.5097 96 96 74.5097 96 48C96 21.4903 74.5097 0 48 0C21.4903 0 0 21.4903 0 48C0 74.5097 21.4903 96 48 96Z"
                        fill="#6B6B6B" />
                    <path
                        d="M54.9216 25.4531H41.0784C28.4447 25.4531 25.4531 28.4447 25.4531 41.0784V54.9216C25.4531 67.5553 28.4447 70.5469 41.0784 70.5469H54.9216C67.5553 70.5469 70.5469 67.5553 70.5469 54.9216V41.0784C70.5469 28.4447 67.5234 25.4531 54.9216 25.4531ZM61.8591 57.6263H58.5778C57.3366 57.6263 56.955 56.64 54.7275 54.3806C52.7859 52.5056 51.9272 52.2488 51.4463 52.2488C50.7778 52.2488 50.5866 52.4363 50.5866 53.3625V56.3222C50.5866 57.1181 50.3316 57.5953 48.2316 57.5953C44.7628 57.5953 40.9125 55.4953 38.2069 51.5803C34.1334 45.8522 33.0197 41.5556 33.0197 40.665C33.0197 40.1878 33.2072 39.7425 34.1334 39.7425H37.4147C38.2425 39.7425 38.5603 40.1241 38.8781 41.0156C40.5009 45.6938 43.2066 49.7991 44.3156 49.7991C44.7291 49.7991 44.9203 49.6116 44.9203 48.5578V43.7203C44.7928 41.4928 43.6153 41.3016 43.6153 40.5066C43.6153 40.125 43.9331 39.7425 44.4431 39.7425H49.5994C50.2997 39.7425 50.5537 40.1241 50.5537 40.9519V47.475C50.5537 48.1753 50.8716 48.4294 51.0628 48.4294C51.4762 48.4294 51.8269 48.1744 52.59 47.4113C54.945 44.7703 56.6316 40.6969 56.6316 40.6969C56.8547 40.2197 57.2362 39.7744 58.0641 39.7744H61.3453C62.3316 39.7744 62.5547 40.2834 62.3316 40.9838C61.9181 42.8934 57.9084 48.5578 57.9084 48.5578C57.5588 49.1306 57.4312 49.3856 57.9084 50.0212C58.2581 50.4984 59.4084 51.4847 60.1678 52.3762C61.5684 53.97 62.6503 55.3041 62.9362 56.2266C63.2597 57.1491 62.7816 57.6263 61.8591 57.6263Z"
                        fill="white" />
                </a>
            </svg>

            <svg width="75" height="75" viewBox="0 0 78 78" fill="none" xmlns="http://www.w3.org/2000/svg"> <a
                    href="https://rutube.ru/">
                    <path
                        d="M39 78C60.5391 78 78 60.5391 78 39C78 17.4609 60.5391 0 39 0C17.4609 0 0 17.4609 0 39C0 60.5391 17.4609 78 39 78Z"
                        fill="#6B6B6B" />
                    <path
                        d="M47.0685 27.2964H21V55.423H28.2556V46.2724H42.1587L48.5022 55.423H56.6266L49.6317 46.2303C51.8042 45.8931 53.3682 45.0917 54.3241 43.8267C55.2797 42.5617 55.7578 40.5375 55.7578 37.8388V35.7303C55.7578 34.1278 55.5842 32.8628 55.28 31.8929C54.9757 30.9231 54.4543 30.0796 53.7158 29.3206C52.9336 28.6037 52.0649 28.0977 51.0221 27.7605C49.9793 27.4653 48.6758 27.2964 47.0685 27.2964ZM45.8954 40.0739H28.2556V33.4952H45.8954C46.8944 33.4952 47.5896 33.6637 47.9372 33.959C48.2848 34.2542 48.5022 34.8023 48.5022 35.6037V37.9651C48.5022 38.8084 48.2848 39.3565 47.9372 39.6516C47.5896 39.9468 46.8947 40.0734 45.8954 40.0734V40.0739Z"
                        fill="white" />
                    <path
                        d="M55.1651 26.8144C56.4939 26.8144 57.5719 25.7367 57.5719 24.4072C57.5719 23.0777 56.4939 22 55.1651 22C53.8354 22 52.7574 23.0777 52.7574 24.4072C52.7574 25.7367 53.8354 26.8144 55.1651 26.8144Z"
                        fill="white" />
                </a>
            </svg>

            <svg width="75" height="75" viewBox="0 0 95 95" fill="none" xmlns="http://www.w3.org/2000/svg"> <a
                    href="https://web.telegram.org/k/#@ICC_KTITC">
                    <path
                        d="M47.5 0C21.2663 0 0 21.2663 0 47.5C0 73.7337 21.2663 95 47.5 95C73.7337 95 95 73.7337 95 47.5C95 21.2663 73.7337 0 47.5 0Z"
                        fill="#6B6B6B" />
                    <path
                        d="M70.6127 27.3236L62.1288 70.0984C62.1288 70.0984 60.9424 73.065 57.6794 71.6411L38.1012 56.6311L30.9821 53.1903L18.998 49.1558C18.998 49.1558 17.1589 48.5034 16.9808 47.0795C16.803 45.6556 19.0574 44.8845 19.0574 44.8845L66.6969 26.1962C66.6969 26.1962 70.6127 24.4758 70.6127 27.3236Z"
                        fill="white" />
                    <path
                        d="M36.5964 69.6186C36.5964 69.6186 36.025 69.5652 35.3128 67.3104C34.6011 65.056 30.9822 53.1907 30.9822 53.1907L59.7557 34.918C59.7557 34.918 61.417 33.9094 61.3577 34.918C61.3577 34.918 61.6542 35.0958 60.7643 35.9263C59.8744 36.7571 38.1606 56.2756 38.1606 56.2756"
                        fill="#D2E5F1" />
                    <path
                        d="M45.6079 62.3869L37.8639 69.4473C37.8639 69.4473 37.2586 69.9067 36.5962 69.6187L38.0791 56.5039"
                        fill="#B5CFE4" />
                </a> </svg>
        </div>
    </div>
    <iframe
        src="https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d2242.516602280049!2d49.18275701101696!3d55.801631334775514!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x415eb281ef8e4d65%3A0x5b12cc06fe4a5dfe!2z0JrQsNC30LDQvdGB0LrQuNC5INGC0LXRhdC90LjQutGD0Lwg0LjQvdGE0L7RgNC80LDRhtC40L7QvdC90YvRhSDRgtC10YXQvdC-0LvQvtCz0LjQuSDQuCDRgdCy0Y_Qt9C4!5e0!3m2!1sru!2sru!4v1684001884517!5m2!1sru!2sru"
        width="100%" height="610" style="border:0;" allowfullscreen="" loading="lazy"
        referrerpolicy="no-referrer-when-downgrade"></iframe>
</div>
<!-- Карта -->